artillery/tests/login.yaml
config:
  target: "puppeteer-lambda-dev-login"
  lambda:
    region: "us-east-1"
  variables:
    duration:
      - "1"
    loadAmount:
      - "5"
  phases:
    - duration: 1
      arrivalCount: 5
  engines:
    lambda: {}
scenarios:
  - engine: "lambda"
    flow:
      - invoke:
          clientContext: '{"app": "Login Load Test"}'
          invocationType: "Event"
          logType: "Tail"
          payload: '{"email": "tomsmith", "password": "SuperSecretPassword!"}'
      - think: 1